deviTangt/STM32H743Code_Backup/LL_Program/Start/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/

#include "stm32h7xx_ll_adc.h"
#include "stm32h7xx_ll_dma.h"
#include "stm32h7xx_ll_rcc.h"
#include "stm32h7xx_ll_crs.h"
#include "stm32h7xx_ll_bus.h"
#include "stm32h7xx_ll_system.h"
#include "stm32h7xx_ll_exti.h"
#include "stm32h7xx_ll_cortex.h"
#include "stm32h7xx_ll_utils.h"
#include "stm32h7xx_ll_pwr.h"
#include "stm32h7xx_ll_tim.h"
#include "stm32h7xx_ll_usart.h"
#include "stm32h7xx_ll_gpio.h"

#if defined(USE_FULL_ASSERT)
#include "stm32_assert.h"
#endif /* USE_FULL_ASSERT */

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "__HARDWARE_CONFIG__.h"
#include <stdio.h>
#include "bsp_timer.h"
#include "TJC_USART.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define KEY_1_Pin LL_GPIO_PIN_3
#define KEY_1_GPIO_Port GPIOE
#define KEY_1_EXTI_IRQn EXTI3_IRQn
#define LED_1_Pin LL_GPIO_PIN_1
#define LED_1_GPIO_Port GPIOA
#define TFTLCD_SDA_Pin LL_GPIO_PIN_7
#define TFTLCD_SDA_GPIO_Port GPIOA
#define KEY_2_Pin LL_GPIO_PIN_5
#define KEY_2_GPIO_Port GPIOC
#define KEY_2_EXTI_IRQn EXTI9_5_IRQn
#define TJC_TX_Pin LL_GPIO_PIN_7
#define TJC_TX_GPIO_Port GPIOE
#define TJC_RX_Pin LL_GPIO_PIN_8
#define TJC_RX_GPIO_Port GPIOE
#define TFTLCD_BL_Pin LL_GPIO_PIN_15
#define TFTLCD_BL_GPIO_Port GPIOD
#define TFTLCD_CS_Pin LL_GPIO_PIN_5
#define TFTLCD_CS_GPIO_Port GPIOD
#define TFTLCD_DC_Pin LL_GPIO_PIN_6
#define TFTLCD_DC_GPIO_Port GPIOD
#define TFTLCD_RES_Pin LL_GPIO_PIN_7
#define TFTLCD_RES_GPIO_Port GPIOD
#define TFTLCD_SCL_Pin LL_GPIO_PIN_3
#define TFTLCD_SCL_GPIO_Port GPIOB
#ifndef NVIC_PRIORITYGROUP_0
#define NVIC_PRIORITYGROUP_0         ((uint32_t)0x00000007) /*!< 0 bit  for pre-emption priority,
                                                                 4 bits for subpriority */
#define NVIC_PRIORITYGROUP_1         ((uint32_t)0x00000006) /*!< 1 bit  for pre-emption priority,
                                                                 3 bits for subpriority */
#define NVIC_PRIORITYGROUP_2         ((uint32_t)0x00000005) /*!< 2 bits for pre-emption priority,
                                                                 2 bits for subpriority */
#define NVIC_PRIORITYGROUP_3         ((uint32_t)0x00000004) /*!< 3 bits for pre-emption priority,
                                                                 1 bit  for subpriority */
#define NVIC_PRIORITYGROUP_4         ((uint32_t)0x00000003) /*!< 4 bits for pre-emption priority,
                                                                 0 bit  for subpriority */
#endif

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
